testsuite_results/sysbench/results/oltp_update_non_index.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 5002.59 qps: 5002.59 (r/w/o: 0.00/5002.59/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5071.75 qps: 5071.75 (r/w/o: 0.00/5071.75/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5110.80 qps: 5110.80 (r/w/o: 0.00/5110.80/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           305595
        other:                           0
        total:                           305595
    transactions:                        305595 (5092.25 per sec.)
    queries:                             305595 (5092.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5092.2472
    time elapsed:                        60.0120s
    total number of events:              305595

Latency (ms):
         min:                                    3.66
         avg:                                   12.57
         max:                                   50.66
         95th percentile:                       14.73
         sum:                              3840094.38

Threads fairness:
    events (avg/stddev):           4774.0625/9.61
    execution time (avg/stddev):   60.0015/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 5125.74 qps: 5125.74 (r/w/o: 0.00/5125.74/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5160.90 qps: 5160.90 (r/w/o: 0.00/5160.90/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5170.51 qps: 5170.51 (r/w/o: 0.00/5170.51/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           309496
        other:                           0
        total:                           309496
    transactions:                        309496 (5157.56 per sec.)
    queries:                             309496 (5157.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5157.5593
    time elapsed:                        60.0084s
    total number of events:              309496

Latency (ms):
         min:                                    3.78
         avg:                                   12.41
         max:                                   34.18
         95th percentile:                       14.46
         sum:                              3840500.79

Threads fairness:
    events (avg/stddev):           4835.8750/17.24
    execution time (avg/stddev):   60.0078/0.00